Luos-io/luos_engine/network/serial_network/HAL/STM32F4/serial_network_hal.c
/******************************************************************************
 * @file serial_hal
 * @brief serial communication hardware abstraction layer
 * @author Luos
 * @version 0.0.0
 ******************************************************************************/

#include "serial_network_hal.h"
#include "_serial_network.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_ll_usart.h"
#include "stm32f4xx_ll_gpio.h"
#include "stm32f4xx_ll_exti.h"
#include "stm32f4xx_ll_dma.h"
#include "stm32f4xx_ll_system.h"
#include "stm32f4xx_hal.h"

/*******************************************************************************
 * Variables
 ******************************************************************************/
static uint32_t rx_buffer_size;
volatile uint16_t RX_PrevPointerPosition = 0;

/*******************************************************************************
 * Function
 ******************************************************************************/

/******************************************************************************
 * @brief Initialisation of the Serial communication
 * @param None
 * @return None
 * ****************************************************************************/
void SerialHAL_Init(uint8_t *rx_buffer, uint32_t buffer_size)
{
    rx_buffer_size         = buffer_size;
    RX_PrevPointerPosition = 0;

    LL_USART_DeInit(SERIAL_COM);
    ///////////////////////////////
    // GPIO SERIAL Init
    ///////////////////////////////
    SERIAL_TX_CLK();
    SERIAL_RX_CLK();

    GPIO_InitTypeDef GPIO_InitStruct = {0};

    // TX
    GPIO_InitStruct.Pin       = SERIAL_TX_PIN;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_PULLUP;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = SERIAL_TX_AF;
    HAL_GPIO_Init(SERIAL_TX_PORT, &GPIO_InitStruct);
    // RX
    GPIO_InitStruct.Pin       = SERIAL_RX_PIN;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_PULLUP;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = SERIAL_RX_AF;
    HAL_GPIO_Init(SERIAL_RX_PORT, &GPIO_InitStruct);

    ///////////////////////////////
    // USART SERIAL Init
    ///////////////////////////////
    SERIAL_COM_CLOCK_ENABLE();

    LL_USART_InitTypeDef USART_InitStruct;
    // Initialise USART3
    LL_USART_Disable(SERIAL_COM);
    USART_InitStruct.BaudRate            = SERIAL_NETWORK_BAUDRATE;
    USART_InitStruct.DataWidth           = LL_USART_DATAWIDTH_8B;
    USART_InitStruct.StopBits            = LL_USART_STOPBITS_1;
    USART_InitStruct.Parity              = LL_USART_PARITY_NONE;
    USART_InitStruct.TransferDirection   = LL_USART_DIRECTION_TX_RX;
    USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
    USART_InitStruct.OverSampling        = LL_USART_OVERSAMPLING_16;
    while (LL_USART_Init(SERIAL_COM, &USART_InitStruct) != SUCCESS)
        ;
    LL_USART_Enable(SERIAL_COM);

    RX_PrevPointerPosition = 0;

    ///////////////////////////////
    // DMA SERIAL Init
    ///////////////////////////////
    LL_DMA_DeInit(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL);
    LL_DMA_DeInit(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL);

    SERIAL_RX_DMA_CLOCK_ENABLE();
    SERIAL_TX_DMA_CLOCK_ENABLE();

    // RX DMA
    LL_DMA_DisableStream(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL);
    LL_DMA_SetChannelSelection(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, SERIAL_TX_DMA_REQUEST);
    LL_DMA_SetDataTransferDirection(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
    LL_DMA_SetStreamPriorityLevel(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, LL_DMA_PRIORITY_LOW);
    LL_DMA_SetMode(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, LL_DMA_MODE_CIRCULAR);
    LL_DMA_SetPeriphIncMode(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, LL_DMA_PERIPH_NOINCREMENT);
    LL_DMA_SetMemoryIncMode(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, LL_DMA_MEMORY_INCREMENT);
    LL_DMA_SetPeriphSize(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, LL_DMA_PDATAALIGN_BYTE);
    LL_DMA_SetMemorySize(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, LL_DMA_MDATAALIGN_BYTE);

    // Prepare buffer
    LL_DMA_SetPeriphAddress(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, (uint32_t)&SERIAL_COM->DR);
    LL_DMA_SetDataLength(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, buffer_size);
    LL_DMA_SetMemoryAddress(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL, (uint32_t)rx_buffer);
    LL_USART_EnableDMAReq_RX(SERIAL_COM);
    LL_DMA_EnableStream(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL);

    // TX DMA
    LL_DMA_DisableStream(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL);
    LL_DMA_SetChannelSelection(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, SERIAL_TX_DMA_REQUEST);
    LL_DMA_SetDataTransferDirection(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, LL_DMA_DIRECTION_MEMORY_TO_PERIPH);
    LL_DMA_SetStreamPriorityLevel(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, LL_DMA_PRIORITY_LOW);
    LL_DMA_SetMode(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, LL_DMA_MODE_NORMAL);
    LL_DMA_SetPeriphIncMode(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, LL_DMA_PERIPH_NOINCREMENT);
    LL_DMA_SetMemoryIncMode(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, LL_DMA_MEMORY_INCREMENT);
    LL_DMA_SetPeriphSize(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, LL_DMA_PDATAALIGN_BYTE);
    LL_DMA_SetMemorySize(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, LL_DMA_MDATAALIGN_BYTE);

    // Prepare buffer
    LL_DMA_SetPeriphAddress(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, (uint32_t)&SERIAL_COM->DR);
    LL_USART_EnableDMAReq_TX(SERIAL_COM);
    HAL_NVIC_EnableIRQ(SERIAL_TX_DMA_IRQ);
    HAL_NVIC_SetPriority(SERIAL_TX_DMA_IRQ, 1, 1);

    LL_DMA_EnableIT_TC(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL);
}

/******************************************************************************
 * @brief Loop of the Serial communication
 * @param None
 * @return None
 ******************************************************************************/
void SerialHAL_Loop(void)
{
    uint16_t size               = 0;
    uint16_t RX_PointerPosition = 0;

    RX_PointerPosition = rx_buffer_size - LL_DMA_GetDataLength(SERIAL_RX_DMA, SERIAL_RX_DMA_CHANNEL);
    if (RX_PointerPosition != RX_PrevPointerPosition)
    {
        if (SERIAL_RX_DMA_TC(SERIAL_RX_DMA) != RESET) // DMA buffer overflow
        {
            SERIAL_RX_DMA_CLEAR_TC(SERIAL_RX_DMA);
            size = (rx_buffer_size - RX_PrevPointerPosition) + RX_PointerPosition;
        }
        else
        {
            size = RX_PointerPosition - RX_PrevPointerPosition;
        }
        RX_PrevPointerPosition = RX_PointerPosition;
        // Send the received data and size to the serial stack to deencapsulate it and send it to luos_phy
        Serial_ReceptionIncrease(size);
    }
}

/******************************************************************************
 * @brief Initialisation of the Serial communication
 * @param data pointer of the data to send
 * @param size size of the data to send
 * @return None
 ******************************************************************************/
void SerialHAL_Send(uint8_t *data, uint16_t size)
{
    LL_DMA_DisableStream(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL);
    LL_DMA_SetMemoryAddress(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, (uint32_t)data);
    LL_DMA_SetDataLength(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL, size);
    LL_DMA_EnableStream(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL);
}

/******************************************************************************
 * @brief TX DMA IRQ handler
 * @param None
 * @return None
 ******************************************************************************/
void SERIAL_TX_DMA_IRQHANDLER()
{
    // Check if TX DMA is finished
    if ((SERIAL_TX_DMA_TC(SERIAL_TX_DMA) != RESET) && (LL_DMA_IsEnabledIT_TC(SERIAL_TX_DMA, SERIAL_TX_DMA_CHANNEL) != RESET))
    {
        // Clear the DMA irq flags
        SERIAL_TX_DMA_CLEAR_TC(SERIAL_TX_DMA);
        // Call the callback managing the end of the transmission
        Serial_TransmissionEnd();
    }
}

uint8_t SerialHAL_GetPort(void)
{
    // We may return the USARt peeripheral number as port number
    // For now let's just consider that the port is 0
    return 0;
}
